app/controllers/experiences_controller.rb

INSERT INTO "experiences" ("profile_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["profile_id", 2], ["created_at", "2022-01-15 10:42:26.171754"], ["updated_at", "2022-01-15 10:42:26.171754"]]
INSERT INTO "projects" ("experience_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["experience_id", 23], ["created_at", "2022-01-16 19:07:31.841709"], ["updated_at", "2022-01-16 19:07:31.841709"]]
---
    def new
        exp = current_user.profile.experiences.create
        exp.projects.create