app/controllers/profiles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def view
        @user = User.find(params.dig(:id))

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "profiles" SET "primary_skills" = $1, "updated_at" = $2 WHERE "profiles"."id" = $3  [["primary_skills", "{\"Java \",\" Spring Boot\",\" Ruby Rails\"}"], ["updated_at", "2022-01-16 18:19:49.718506"], ["id", 2]]
---
    def update
        updated_profile_params = update_array_attributes_in_params(profile_params)
        @profile = Profile.find(params[:id])
        if @profile.update(updated_profile_params)

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def correct_user
        @profile = Profile.find(params[:id])
        @user = User.find(@profile.user_id)