app/controllers/projects_controller.rb

    def new
        exp = Experience.find_by(id: params.dig(:experienceId))
        exp.projects.create
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
INSERT INTO "projects" ("experience_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["experience_id", 22], ["created_at", "2022-01-16 18:16:25.280712"], ["updated_at", "2022-01-16 18:16:25.280712"]]