app/controllers/users_controller.rb

  def create_user
    user = User.find_by(email: params[:user][:email])
    if user.present?
      flash.now[:danger] = 'Email already in use'
      render('home/signup') and return
    end

    user = User.create(create_params(params))
    user.profile.create
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "java@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE LOWER("users"."email") = LOWER($1) LIMIT $2  [["email", "mohdarif8299@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 8], ["created_at", "2022-01-16 19:31:25.289365"], ["updated_at", "2022-01-16 19:31:25.289365"]]